# writing - კოდის წერა
# running - გაშვება / კოდის წერა 
# or beduggin - შეცდომების შესწორება / კოდში არსებული შეცდომების გასწორება


print("hello")
# parentheses - ფრიჩხილები
# quotation marks  - ბრჭყალები
# define - განსაზღვრა / შექმა
# variable - ცვლადი
# vlue - განსაზღვრება
# string - მონაცემთა ტიპი რომელიც აღნიშნავს ბრჭყალებში მოქცეული ტექსტი
# integer - მონაცემთა ტიპი რომელიც აღნიშნავს მთელ რიცხვს 
# bugs - შეცდომა / პრობლემა
# float - მონაცემთა ტიპი რომელიც აღნიშნავს წილად რიცხვს მაგალითად : 0,5  0,2  2,5 

car = "BMW"
car2 = "MERCEDES"
print("I love",  car)
print("I love", car2)
# common - ხშირი