# 1) მომხმარებელს input-ის გამოყენებით უნდა შემოატანინოთ მონაცემთა ტიპი და შემდეგ უნდა დაპრინტოთ მომხმარებლის შეტანილი მონაცემთა ტიპი example: თუ მომხმარებელმა შემოიტანა string-ი მაშინ უნდა გამოიტანოს <class string>
name = input("enter your name: ")
print(type(name))

# 2) შექმენით ცვლადი სადაც შეიტანთ string-ს და უნდა დაპრინტოთ ცვლადის მონაცემთა ტიპი
car = "BMW"
print(type(car))
name = "Nika"
print(type(name))

# 3) შექმენით ცვლადი სადაც შეიტანთ string-ს და ეს სტრინგი უნდა გადააქციოთ ინტეჯერად და უნდა ახსნათ კომენტარებით რატო არ შეიძლება რომ ეს string-ი გადავაქციოთ ინტეჯერად

academy = "GOA"
print(academy) # იმიტომ არ გადაიქცა , რომ stirng გამოიყენება ტექსტის წარმოსჩენად და არა რიცხვების ხოლო integer გამოიყენება რიცხვების გამოსაჩენა .

# 4) ახსენით type ფუნქცია რას აკეთებს კომენტარებით და გააკეთეთ მაგალითებიც .
#  type() აბრუნებს ობიექტის ტიპს, ან აბრუნებს ახალი ტიპის ობიექტს გადაცემული არგუმენტების საფუძველზე .
 
a = "5"
b = 20
c = 50/2
print(type(a))
print(type(b))
print(type(c)) 



# 5) გატესტეთ და ეს კოდი ახსენით კომენტარებით რას აკეთებს .


num1 = "10"
num2 = "10"
print(int(num1) + int(num2)) # string-ის მონაცემთა ტიპი გადააქცია integer-ად .

# 6) ახსენით კომენტარებით რას ნიშნავს string, integer, float და გააკეთეთ რამოდენიმე მაგალითიც 
# string - არის მონაცემთა ტიპი რომელიც იწერება ბრჭყალებში string გამოიყენება ტექსტის წარმოსაჩენად 
# integer - გამოიყენება რიცხვების წარმოსაჩენად
# float - ტიპის (ათწილადები)

# 7) გააკეთეთ 1500 ერორი ვისაც არ გქონდათ გაკეთებული.      გაკეთებული მაქვს .
# 8) გაიმეორე გავლილი მასალა

# # input - მონაცემების და ინფორმაციების შეტანა/შეყვანა 
# output - გამოტანა / გამოყვანა რომელსაც რაღაცა ინფორმაცია გამოაქვს ეკრანზე

# debbuger -არის გამართვის პროგრამა, გასამართი/გამმართველი პროგრამა (დამხმარე პროგრამა, რომელიც გამოიყენება სხვა პროგრამების შესამოსწმებლად გასამართად)

# 9) sololearn 
