 # 1) შექმენით ცვლადი სადაც მიანიჭებთ თქვენს სახელს ეს ცვლადი უნდა დააკომენტაროთ და დაპრინტოთ და ახსნათ კომენტარებით რატომ ვერ გამოიტანს ცვლადის მნიშვნელობას
 # name = "Nika" 
#print(name) # ეს არის შეცდომა იმიტომ, კომენტარი გადასცემს კოდის საჭირო ინფორმაციებს ადამიანებს . ასევე გამოიყენება კოდის გათიშვისთვის დროებით


# 2)  ახსენით კომენტარებით რა არის case-sensitive language და გააკეთეთ რამოდენიმე მაგალითიც
# case - sensitive - language - ითარგმნება როგორც ქეის სენსიტიური ენა დიდი და პატარა ასოები ძალიან განსხვავდებიან ერთმანეთისგან
#Print() # არასწორია 
#print() # სწორია
name = "nika" 
NAME = "nika"

print(name) # ტერმინალში გამოიტანს პატარა ასოებით დაწერილ ცვლადს
print(NAME) # ტერმინალში გამოიტანს დიდი ასოებით დაწერილ ცვლადს

 # 3) შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის
credit = 100 # uppercase - პატარა ასო
Credit = 200 # lowercase - დიდი ასო
CREDIT = 500 # lowercase - დიდი ასო

#  შექმენით 2 ცვლადი რომელიც ექნება ერთნაირი სახელები და სხვადახსხვანაირი მნიშვნელობები და  უნდა დაპრინტოთ და ასევე ახსენით კომენტარებით რატომ გამოიტანს პირველ ცვლადს და არა მეორე ცვლადს
car_name = "BMW"
car_name = "mercedes"
print(car_name)