# ბანკის პროექტი
# chatbot
# ჯეირანი

# random

# html -არის სტრუქტურა 
# css - არის სტილი
# javascript - არის ინტერაქტიული გასაკაეთებლად

# ელემენტები, როგორიცაა ღილაკები და აბზაცის ტექსტი, მოითხოვს კონტეინერის ტეგებს


#ელემენტები, როგორიცაა ღილაკები და აბზაცის ტექსტი, მოითხოვს კონტეინერის ტეგებს
#კონტეინერის ტეგები შედგება როგორც გახსნის < > , ასევე დახურვის </> თეგებისგან
# შეგიძლიათ გამოიყენოთ Code Playground რეალური HTML კოდის დასაწერად, გასაშვებად და შესამოწმებლად

#frontend - საიტის ვიზუალური მხარე
#backend - საიტის ფუნქციონალური მხარე
#interactivity - ინტერაქციულობა
#
#HTML - საიტის ჩონჩხი
#CSS - საიტის დიზანი
#Javascript - საიტის ფუნქციონალი
#
#HTML - HyperText Markup Language
#Markup Symbols - <>
#
#container element - ისეთი ელემენტი რომელსაც აქვს გამხსნელი და დამხურავი თეგი
#empty element - ისეთი ელემენტი რომელსაც აქვს მხოლოდ გამხსნელი თეგი
#
#header - სათაური
#button - ღილაკი
#paragraph - პარაგრაფი ტექსტი
#

